# python
#1.面向过程与面向对象
#面向过程：分析解决问题的步骤，把步骤拆解成一个个方法，没有对象调用的，通过一个个的方法去执行（是指用手洗衣服）
#面向对象：将编程当作一个事物，直接使用，不用管过程（是指用洗衣机洗衣服）
#2.类与对象：
#类：一系列具有相同属性与行为的事物的统称，不是真实存在的事物
#对象是类的具体体现，是类创建出来的真实存在的事物，面向对象的核心
#在开发中，先有类，再有对象
#2.1类的三要素
#1.类名
#2.属性：对象的特征描述，用来说明是什么样子
#3.方法：对象具有的功能，用来说明能做什么
#2.2定义类
#基本格式
class类名:#类名符合标识符规定，并采取大驼峰命名法
   代码块
class Washer:
     height=800  #类属性：就是类有的属性
print(Washer.height)  #查看类属性：类名.属性名
#新增类属性：类名.属性名=值
#2.3创建对象
#创建对象的过程叫做实例化对象
#2.3.1实例化对象的基本格式：对象名=类名（）
#实例化一个洗衣机对象
wa=Washer()
print(wa)  #默认显示的是对象的地址
#可进行二次实例化，体现不同的地址，相当于用相同模板制造的不同洗衣机的地址
2.4.1实例与方法
#由对象调用，至少有一个self参数，执行实例方法时，自动将调用该方法的对象赋值给self
class Washer:
  height=800  #类属性
  def wash(self):    #实例方法：其中self是必须具备的,self表示当前调用方法的对象
  print("我会洗衣服")
wa =Washer()    #实例化对象
wa.wash()  
wa2=Washer()
print("wa2:",wa2)
wa2.wash()
#self代表对象本身，当对象调用实例方法时，python会自动将对象本身引用作为参数，传递到实例方法的第一个参数self中
